Revit 2027 API
NumberingSchema.SetUseBuiltInMatchingForCategories Method
 Use the built-in matching criteria for a set of categories if one is available for a given category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetUseBuiltInMatchingForCategories(
	ISet<ElementId> categories
)
Public Sub SetUseBuiltInMatchingForCategories (
	categories As ISet(Of ElementId)
)
public:
void SetUseBuiltInMatchingForCategories(
	ISet<ElementId^>^ categories
)
member SetUseBuiltInMatchingForCategories :
        categories : ISet<ElementId> -> unit
Parameters
categories ISet<ElementId>
 The set of categories to enable specialized built-in matching for.
Exceptions
Exception | Condition
ArgumentException |  Not all the ids for the provided categories have built-in matching.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace